/* -------------------- */
/*      ビットフラグ      */
/* -------------------- */
#define BIT_FLAG_1  (0x0001) // 2進数 : (0000 0000 0000 0001)
#define BIT_FLAG_2  (0x0002) // 2進数 : (0000 0000 0000 0010)
#define BIT_FLAG_4  (0x0004) // 2進数 : (0000 0000 0000 0100)
#define BIT_FLAG_8  (0x0008) // 2進数 : (0000 0000 0000 1000)
#define BIT_FLAG_16 (0x0010) // 2進数 : (0000 0000 0001 0000)
#define BIT_FLAG_32 (0x0020) // 2進数 : (0000 0000 0010 0000)
#define BIT_FLAG_64 (0x0040) // 2進数 : (0000 0000 0100 0000)
#define BIT_FLAG_128 (0x0080) // 2進数 : (0000 0000 1000 0000)


/* -------------------- */
/*     スイッチON/OFF     */
/* -------------------- */
#define ON (1)
#define OFF (0)

/* -------------------- */
/*  関数(プロトタイプ)宣言  */
/* -------------------- */
static void bit_extractor(int flag, int value);